#include <iostream>
#include <cmath>

//5ый вариант первое задание
int main()
{
    //Всего членов 15 т. к. a0, a1 .. a14.
    const int n = 15;
    //Инициализируем общее произведение тк a0 и a1 = 1
    double Product = 1.0, ai_1 = 1.0, ai_2 = 1.0;
    //Инициализируем предыдущие значения цикла a i-1 = a1 a i-2 = a0
    //Цикл с параметром от a4 до a14, 13 раз т.к. предыдущие 4 члена ai мы проинициализировали
    for (int i = 2; i < n; ++i)
    {
        //Вычисление a4, a5 ... a14
        double ai = ai_2 + ai_1 / pow(2.0, ai_1);
        //Вывод результата произведения
        std::cout << ai << "\n";
        //Домножение общего произведения членов ai
        Product *= ai;
        //a i-2 = a i-1 тк i увеличился на 1
        ai_2 = ai_1;
        //перезапись a i-1 a i тк i увеличился на 1
        ai_1 = ai;
    }
    //Вывод общего произведения
    std::cout << "a0 * a1 * ... * a14 = " << Product << std::endl;
    //5 вариант второе задание
    double range_break = 0.0;
    double const a = -2.0, b = 7.0;
    std::cout << "Для построения прямоугольника использовать формула Симпсона" << std::endl;
    std::cout << "y = 0, y = 5.0 * x - x * x + 14.0" << std::endl;
    std::cout << "a = -2.0, b = 7.0" << std::endl;
    std::cout << "Введите интервал разбиения: " << std::endl;
    std::cin >> range_break;
    double h = (b - a) / range_break, S1 = 0.0, S2 = 0.0;
    for (int i = 1; i < range_break; ++i)
    {
        double x = a + i * h;
        if (i % 2 != 0)
            S1 += (5.0 * x - pow(x, 2.0) + 14.0);
        else
            S2 += (5.0 * x - pow(x, 2.0) + 14.0);
    }
    std::cout << "\nОтвет: S = " << (2.0 * h) / 6.0 * (4.0 * S1 + 2.0 * S2 + (5.0 * a - pow(a, 2.0) + 14.0) + (5.0 * b - pow(b, 2.0) + 14.0));
    //Интеграл1(b) - Интеграл1(a) - Интеграл2(b) + Интеграл2(a)
    std::cout << "\nПроверка: S = " << (-pow(b,3.0) / 3.0 + 2.5 * pow(b,2.0) + 14.0 * b) - (-pow(a,3.0) / 3.0 + 2.5 * pow(a,2.0) + 14.0 * a) - 0.0 + 0.0;
    return 0;
}
